In [1]:
import numpy as np
import pandas as pd
df=pd.DataFrame({
                 "modelo":["uno","monza","ferrari","gol","palio"],
                  "marca":["fiat","chevrolet","chevrolet","vw","fiat"],
                   "valor":[1000,2000,3000,4000,5000],
                    "unidade":[10,30,40,40,50]
})
df

    modelo      marca  valor  unidade
0      uno       fiat   1000       10
1    monza  chevrolet   2000       30
2  ferrari  chevrolet   3000       40
3      gol         vw   4000       40
4    palio       fiat   5000       50

In [4]:
df.describe()

            valor    unidade
count     5.00000   5.000000
mean   3000.00000  34.000000
std    1581.13883  15.165751
min    1000.00000  10.000000
25%    2000.00000  30.000000
50%    3000.00000  40.000000
75%    4000.00000  40.000000
max    5000.00000  50.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   modelo   5 non-null      object
 1   marca    5 non-null      object
 2   valor    5 non-null      int64
 3   unidade  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [6]:
df.count()

modelo     5
marca      5
valor      5
unidade    5
dtype: int64